# SubtractPolygon

## Description
Clips one polygon from the other.

```pascal
FUNCTION SubtractPolygon(
				hMinuedPoly : HANDLE;
				hSubtrahend : HANDLE;
				dFuzz       : REAL): HANDLE;
```

```python
def vs.SubtractPolygon(hMinuedPoly, hSubtrahend, dFuzz):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hMinuedPoly|HANDLE|   |
|hSubtrahend|HANDLE|   |
|dFuzz|REAL|   |

## Version
Availability: from Vectorworks 2014

## Category
* Graphic Calculation